      *> COMMON ERROR STATUS CODES
       01  WS-FILE-STATUS.
           05  FS-ACCT             PIC X(02).
           05  FS-TRANS            PIC X(02).
       
       01  WS-ERROR-MSG            PIC X(50).
